---
type: MacroManagerIterator
namespace: Autodesk.Revit.DB.Macros
version: 2024
members: 8
tags: [revit-api, class]
---

# MacroManagerIterator

`Autodesk.Revit.DB.Macros.MacroManagerIterator` · Revit 2024 · 8 members

| Kind | Member | Since | Signature |
| --- | --- | --- | --- |
| Method | Dispose | — | `public void Dispose ()` |
| Method | GetCurrent | 2014 | `public MacroModule GetCurrent ()` |
| Method | IsDone | 2014 | `public virtual bool IsDone ()` |
| Method | MoveNext | 2014 | `public virtual bool MoveNext ()` |
| Method | Reset | 2014 | `public virtual void Reset ()` |
| Property | Current | — | `public virtual MacroModule Current { get ; }` |
| Property | CurrentObject | — | `internal Object CurrentObject { get ; }` |
| Property | IsValidObject | 2014 | `public bool IsValidObject { get ; }` |